# Brewfile
# 使い方: brew bundle --file=~/Workspace/tachibanayu24/.dotfiles/Brewfile

# CLI Tools
brew "git"
brew "neovim"
brew "bat"              # cat の代替
brew "tree"             # ディレクトリ構造の表示
# brew "rbenv"            # Ruby バージョン管理
# brew "pyenv"            # Python バージョン管理
brew "zimfw"            # Zsh フレームワーク
brew "curl"
brew "wget"

# Development Tools
brew "docker"
brew "docker-compose"
brew "gh"               # GitHub CLI

# Useful Tools
brew "jq"               # JSON processor

# Fonts
cask "font-hack-nerd-font"

# GUI Applications
cask "slack"
cask "notion"
cask "visual-studio-code"
cask "google-chrome"
cask "warp"
cask "ghostty"
cask "chatgpt"
cask "claude"
cask "raycast"
cask "karabiner-elements"
cask "the-unarchiver"
cask "itsycal"
cask "zoom"
cask "giphy-capture"
